load-tests.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up"
    - duration: 60
      arrivalRate: 100
      name: "Sustained load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  processor: "./load-test-processor.js"
  defaults:
    headers:
      User-Agent: "Artillery Load Test"

scenarios:
  - name: "API Health Check"
    flow:
      - get:
          url: "/api/health"

  - name: "Authentication Flow"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@erp.local"
            password: "Admin123!"
          expect:
            - statusCode: 200

  - name: "List Usuarios"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@erp.local"
            password: "Admin123!"
          capture:
            json: "$.data.tokens.access"
            as: "token"
      - get:
          url: "/api/usuarios"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "CRUD Operations"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@erp.local"
            password: "Admin123!"
          capture:
            json: "$.data.tokens.access"
            as: "token"
      
      # GET
      - get:
          url: "/api/clientes"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      # POST
      - post:
          url: "/api/clientes"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            nombre: "Load Test Client"
            rut: "12.345.678-9"
            email: "client@test.com"
          expect:
            - statusCode: 201

      # PUT
      - put:
          url: "/api/clientes/1"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            nombre: "Updated Client"
          expect:
            - statusCode: 200

      # DELETE
      - delete:
          url: "/api/clientes/1"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200